## Project: Data Cleaning with Pandas

#### Below will be a series of user stories, followed by an empty Python code block
* These user stories will go through the process of importing, cleaning, and exporting the included `dirty_cars_dataset.csv` file
* Be sure to read each question carefully, and to test and debug your code to ensure the user story is completed correctly!

### As a Data Analyst, I want to set up the proper imports so I have access to the Pandas library

In [25]:
import pandas as pd

### As a Data Analyst, I want to import and store the `dirty_cars_dataset.csv` file in a variable
✅ I want to use the `index` column from this .csv file as the `index column` of my DataFrame

In [26]:
df = pd.read_csv("dirty_cars_dataset.csv", index_col= "index")
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,1650000.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

### As a Data Analyst, I want to view the **information** about my new DataFrame to answer the following questions:
##### Enter your responses in the Markdown block below

* How many entries are in this DataFrame: 64 entries 
* How many columns are in this DataFrame: 9 columns
* Which column(s) contain null values in this DataFrame: 3 columns with null values

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 64 entries, 0 to 88
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company           64 non-null     object
 1   body-style        64 non-null     object
 2   wheel-base        64 non-null     float64
 3   length            64 non-null     float64
 4   engine-type       64 non-null     object
 5   num-of-cylinders  64 non-null     object
 6   horsepower        64 non-null     int64
 7   average-mileage   64 non-null     int64
 8   price             61 non-null     float64
dtypes: float64(3), int64(2), object(4)
memory usage: 5.0+ KB

### As a Data Analyst, I want to to remove any null values from the DataFrame
✅ I want to **create a new DataFrame variable** when I remove these null values<br>
✅ Then, I want to display the **information** about my new DataFrame, to confirm the null values were successfully removed

In [28]:
non_null_df = df.dropna()
non_null_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 0 to 88
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company           61 non-null     object
 1   body-style        61 non-null     object
 2   wheel-base        61 non-null     float64
 3   length            61 non-null     float64
 4   engine-type       61 non-null     object
 5   num-of-cylinders  61 non-null     object
 6   horsepower        61 non-null     int64
 7   average-mileage   61 non-null     int64
 8   price             61 non-null     float64
dtypes: float64(3), int64(2), object(4)
memory usage: 4.8+ KB

### As a Data Analyst, I want to check if there are any **duplicate rows** within my DataFrame

In [29]:
df.duplicated().sort_values()

index
0     False
44    False
45    False
46    False
47    False
      ...
88    False
49     True
32     True
27     True
83     True
Length: 64, dtype: bool

### As a Data Analyst, I want to **remove** any duplicate values from the DataFrame
✅ I want to **create a new DataFrame variable** when I remove these duplicate values<br>
✅ I want to again check if there are any duplicate rows within my DataFrame, to ensure the values were removed successfully

In [30]:
deduped_df = df.drop_duplicates()
deduped_df[deduped_df.duplicated()]

Empty DataFrame
Columns: [company, body-style, wheel-base, length, engine-type, num-of-cylinders, horsepower, average-mileage, price]
Index: []

### As a Data Analyst, I want to ensure I remove any outlier values from my DataFrame to avoid inaccurate analysis of my data
✅I want to **create a new DataFrame variable** when I remove these values<br><br>
💡 **Hint:** These inaccuracies will be within the `price` column 💡<br><br>
💡 **Hint** There will be both **high** and **low** outlier values 💡

In [31]:
# Removing high outlier values
sorted_df = deduped_df.sort_values('price')
sorted_df.head()
no_upper_outlier_df = sorted_df.drop(53)
no_upper_outlier_df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
48,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0

In [32]:
# Removing low outlier values
sorted_df = deduped_df.sort_values("price")
sorted_df.tail()
no_lower_outlier_df = sorted_df.drop(2)
no_lower_outlier_df.tail()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

### As a Data Analyst, I want to reformat the **company** series, ensuring all company name values are properly title (Pascal) cased

In [37]:
df["company"] = df["company"].str.title()

df

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,Alfa-Romero,hatchback,94.5,171.2,ohcv,six,154,19,1650000.0
3,Audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,Audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
82,Volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
83,Volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
86,Volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
87,Volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
88,Volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

### As a Data Analyst, I want to create a ***new*** column on my DataFrame to represent the **price of each car in Euros**
💡 **Use the conversion rate 1.05 USD == 1 Euro** 💡

In [38]:
df["price_euro"] = df["price"] * 1.05

df

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,price_euro
index,,,,,,,,,,
0,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,14169.75
1,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,17325.00
2,Alfa-Romero,hatchback,94.5,171.2,ohcv,six,154,19,1650000.0,1732500.00
3,Audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,14647.50
4,Audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,18322.50
...,...,...,...,...,...,...,...,...,...,...
82,Volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0,8394.75
83,Volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0,8394.75
86,Volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0,10494.75
87,Volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0,13587.00
88,Volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0,14085.75

### As a Data Analyst, I want to rename the existing **price** column to show that it represents **price in USD**

In [40]:
renamed_df = df.rename(columns= {"price" : "price_usd"})
renamed_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 64 entries, 0 to 88
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company           64 non-null     object
 1   body-style        64 non-null     object
 2   wheel-base        64 non-null     float64
 3   length            64 non-null     float64
 4   engine-type       64 non-null     object
 5   num-of-cylinders  64 non-null     object
 6   horsepower        64 non-null     int64
 7   average-mileage   64 non-null     int64
 8   price_usd         61 non-null     float64
 9   price_euro        61 non-null     float64
dtypes: float64(4), int64(2), object(4)
memory usage: 5.5+ KB

### As a Data Analyst, I want to output my cleaned DataFrame as a .csv file
✅ I want to name this file `cleaned_cars_dataset.csv`<br>
✅ I want to specify the encoding type 'utf-8'<br>
✅ I want to include this .csv file in my GitHub repository